{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "batch_input_shape": [null, 9],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 9,
            "activation": "softmax"
          }
        }
      ]
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js",
    "weightsManifest": [
      {
        "paths": ["ttt_model.weights.bin"],
        "weights": [
          { "name": "dense_1/kernel", "shape": [9, 64], "dtype": "float32" },
          { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
          { "name": "dense_2/kernel", "shape": [64, 64], "dtype": "float32" },
          { "name": "dense_2/bias", "shape": [64], "dtype": "float32" },
          { "name": "dense_3/kernel", "shape": [64, 9], "dtype": "float32" },
          { "name": "dense_3/bias", "shape": [9], "dtype": "float32" }
        ]
      }
    ]
  }
}
